pcbreflux/nordic/nRF51822/ble_app_max6675/main.c
// defining SPI0
const nrf_drv_spi_t my_spi_0 = NRF_DRV_SPI_INSTANCE(0); /**< Declaring an instance of nrf_drv_spi for SPI0. */

const uint32_t led_pin1 = 19;

static max6675_config_t max6675_config = MAX6675_DEFAULT_CONFIG;
static uint32_t pos=0;

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name) {
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for handling File Data Storage events.
 *
 * @param[in] p_evt  Peer Manager event.
 * @param[in] cmd
 */
static void fds_evt_handler(fds_evt_t const * const p_evt) {
    if (p_evt->id == FDS_EVT_GC) {
        NRF_LOG_INFO("GC completed\n");
    }
}

/**@brief Function for handling write events to the MAX6675 characteristic.
 *
 * @param[in] p_max6675  Instance of MAX6675 Service to which the write applies.
 * @param[in] led_state Written/desired state of the LED.
 */
static void blemax6675_write_handler(ble_max6675_t * p_max6675, ble_max6675_evt_t *evt) {
    uint32_t err_code;

    if (evt->evt_type == BLE_MAX6675_EVT_NOTIFICATION_ENABLED) {
    	NRF_LOG_INFO("BLE_MAX6675_EVT_NOTIFICATION_ENABLED\r\n");
        err_code = app_timer_start(m_max6675_timer_id, MAX6675_INTERVAL, NULL);
        APP_ERROR_CHECK(err_code);
        p_max6675->running=1;
    } else { // BLE_MAX6675_EVT_NOTIFICATION_DISABLED | BLE_MAX6675_EVT_DISCONNECTED
    	NRF_LOG_INFO("BLE_MAX6675_EVT_NOTIFICATION_DISABLED\r\n");
		max6675_unprepare(&max6675_config);
        err_code = app_timer_stop(m_max6675_timer_id);
        p_max6675->running=0;
        APP_ERROR_CHECK(err_code);
    }
}

/** @brief Function initialization and configuration of RTC driver instance.
 */
static void spi_config(max6675_config_t *max6675_config) {
    ret_code_t err_code;

    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;

    NRF_LOG_DEBUG("spi config %d %d %d\n\r",max6675_config->miso_pin,max6675_config->sck_pin,max6675_config->cs_pin);
    spi_config.sck_pin = max6675_config->sck_pin;
    spi_config.mosi_pin = 0xFF; // not used
    spi_config.miso_pin = max6675_config->miso_pin;
    spi_config.ss_pin = 0xFF; // max6675 need Conversion Time 220ms, so we set it external
    //spi_config.frequency = NRF_DRV_SPI_FREQ_125K; // tCP = 100ns see MAX7219/MAX7221 Datasheet TIMING CHARACTERISTICS
    spi_config.frequency = NRF_DRV_SPI_FREQ_8M; // tCP = 100ns see MAX7219/MAX7221 Datasheet TIMING CHARACTERISTICS
    spi_config.mode = NRF_DRV_SPI_MODE_0; // SCK active high, sample on leading edge of clock.
    spi_config.bit_order = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST;

    err_code = nrf_drv_spi_init(&my_spi_0,&spi_config,NULL);
    APP_ERROR_CHECK(err_code);

}

/**@brief Function for performing max6675 measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void max6675_temp_update(uint16_t temp) {
    uint32_t err_code;

    err_code = ble_max6675_temp_update(&m_max6675, temp);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
        APP_ERROR_HANDLER(err_code);
    }
}


static void max6675_timeout_handler(void * p_context) {
//    uint32_t err_code;

	uint16_t temp;

	NRF_LOG_DEBUG("max6675_timeout_handler %d %u\n\r",pos);
	if (pos%2==0) {
		if (m_max6675.running!=0) {
			max6675_prepare(&max6675_config);
		}
	} else {
		if (m_max6675.running!=0) {
			temp=max6675_readcelsius(&max6675_config);
			NRF_LOG_INFO("max6675_timeout_handler temp \x1B[1;32m%u\x1B[0m,\x1B[1;31m%d\x1B[0m    \r",temp/100,temp%100);
			max6675_temp_update(temp);
		}
	}
    pos++;
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void) {
	uint32_t err_code;

	NRF_LOG_INFO("timers_init\r\n");
    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.
	err_code = app_timer_create(&m_max6675_timer_id,
								APP_TIMER_MODE_REPEATED,
								max6675_timeout_handler);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void) {
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    // Set GAP device name
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    // Set GAP Appearance value
    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_THERMOMETER);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    // Set GAP Peripheral Preferred Connection Parameters
    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void) {
    uint32_t       err_code;
    ble_max6675_init_t blemax6675_init;

